Repository: loginom/admin-guide-l10n
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Использовать HTTPS — включает возможность задать параметры ssl для http:
en: Use HTTPS enables the setting of ssl parameters for http:

source: Использовать WebSocket proxy — включает параметр wsproxy.
en: Use WebSocket proxy activates the wsproxy parameter.

source: Использовать WebSocket proxy — включает проксирование websocket соединений.
en: Use WebSocket proxy activates the proxying of websocket connections.

source: Использовать WebSocket secure — включает возможность задать параметры ssl для websocket:
en: Use WebSocket secure enables the setting of ssl parameters for the websocket:

source: Исходное имя файла запроса, Результирующее имя файла запроса, Команда обработки файла запроса — данные параметры используются для задания команды ОС (операционной системы) предварительной обработки текста запроса перед его отправкой внешнему сервису.
en: The request file source name, The resulting name of the request file, The request file processing command — these parameters are used to assign the OS (operational system) command of the preliminary processing of the request text before its sending to the external service.

source: Исходное имя файла ответа, Результирующее имя файла ответа, Команда обработки ответа — данные параметры используются для задания команды ОС обработки текста ответа сервиса.
en: The response file source name, The resulting name of the response file, The response processing command — these parameters are used to assign the OS command of the service response text processing.

source: Каталог веб-приложения
en: The Web Application Directory

source: Кодировка сообщений — указывается кодировка сообщений, применяемая внешним сервисом.
en: Message encoding — the message encoding applied by the external service is specified.

source: Конфигурация
en: Configuration

source: Лицензионные ключи
en: Licensing Dongles

source: Логин, Пароль — реквизиты для подключения к серверу Loginom.
en: Login, password — credentials for connection to the Loginom server.

source: Логировать запрос — флаг, указывающий, что в лог необходимо сохранять xml-запрос к Адаптеру.
en: Log request — the flag that shows that it is required to save the XML request to the Adapter in the log.

source: Логировать ответ — флаг, указывающий, что в лог необходимо сохранять xml ответы Адаптера.
en: Log response — the flag that shows that it is required to save the Adapter XML responses in the log.

source: Локальный USB-ключ — физический ключ, который рекомендуется для использования единичных экземпляров Loginom на серверах с физическим доступом к usb портам.
en: Local USB dongle is a physical dongle that is recommended for one-off Loginom instances on the servers with physical access to USB ports.

source: Макс.
en: Max.

source: Настройка IIS
en: IIS configuration

source: Настройка
en: Configuration

source: Обновление USB-ключа
en: USB dongle upgrade

source: Обновление
en: Upgrade

source: Описание веб-сервиса — произвольное описание веб-сервиса.
en: The web service description — an arbitrary description of the web service.

source: Описание метода — произвольное описание метода.
en: Method description — an arbitrary method description.

source: Описание параметров
en: Description of parameters

source: Особая учетная запись
en: Special login account

source: Особый формат сообщения — используется для веб-сервисов с нестандартным форматом сообщений, в частности для БКИ «ОКБ».
en: The special message format is used for the web services with nonstandard message format, in particular, for credit reference bureau "UNITED CREDIT BUREAU".

source: Папка для логов — путь к папке для лог-файлов Адаптера.
en: Folder for logs — the path to the folder for the Adapter log files.

source: Параметры XSLT трансформации — указываются в случае, если xslt-преобразования принимают входные параметры.
en: Parameters of the XSLT transformation are specified only if the XSLT transformations accept the input parameters.

source: Пароль к сертификату — для операций с некоторыми сертификатами требуется пароль.
en: The certificate password — a password is required for operations with some certificates.

source: Передавать адрес в заголовке сообщения SOAP — флаг, указывающий на необходимость передачи адреса в заголовке (секции Header) сообщения SOAP.
en: To transfer the address in the SOAP message header — the flag that shows that it is required to transfer the address in the header (the Header sections) of the SOAP message.

source: Подключение к серверу Loginom — содержит параметры для формирования файла конфигурации Loginom Studio
en: Connection to the Loginom server contains parameters for formation of the Loginom Studio configuration file

source: Показать пароль — переключает режим отображения пароля.
en: Show password switches the password display mode.

source: Порт HTTP — определяет номер http порта web-сервера.
en: The HTTP port defines the number of the web server http port.

source: Порт HTTPS — определяет номер https порта web-сервера.
en: The HTTPS port defines the number of the web server https port.

source: Порт WS и Порт WSS — определяют значения параметров wsport и wssport соответственно.
en: The WS port and WSS port defines the values of the wsport and wssport parameters correspondingly.

source: Порт WS — определяет номер порта для подключения Loginom Studio по протоколу websocket (ws).
en: The WS port defines the port number for Loginom Studio connection according to the websocket (ws) protocol.

source: Порт WSS — определяет номер порта для подключения Loginom Studio по протоколу websocket secure (wss).
en: The WSS port defines the port number for the Loginom Studio connection according to the websocket secure (wss) protocol.

source: Порт сервера — определяет номер порта для подключения Loginom Integrator и BatchLauncher.
en: The Server port defines the port number for the Loginom Integrator and BatchLauncher connection.

source: Порт — порт сервера Loginom.
en: Port — the Loginom server port.

source: Приложение — имя web-приложения.
en: Application — web application name.

source: Примечание: Версия Loginom Integrator должна соответствовать версии используемого сервера Loginom.
en: Note: The Loginom Integrator version must comply with the used Loginom server version.

source: Примечание: По умолчанию устанавливаются все компоненты.
en: Note: All components are installed by default.

source: Примечание: После завершения установки в обязательном порядке необходимо изменить пароль учетной записи администратора (admin).
en: Note: Upon installation, it is required to change the administrator account (admin) password.

source: Примечание: Системные требования могут меняться в зависимости от объемов данных и взаимодействия со сторонними приложениями.
en: Note: system requirements can vary according to data volume and interaction with third-party applications.

source: Примечание: Loginom Adapter использует в работе .Net Framework версии 3.5.
en: Note: Loginom Adapter uses .Net Framework, version 3.5 in the work process.

source: Примечание: в случае, когда Loginom Integrator и Loginom Adapter используются на одном сервере IIS, у них должны быть заданы разные пулы приложений.
en: Note: when the Loginom Integrator and Loginom Adapter are used on the one IIS server, different application pools must be set for them.

source: Примечание: в случае, когда клиентский сертификат находится в хранилище, обязательна процедура экспорта из хранилища в файл .CER в DER-кодировке X.509 и указания пути к этому файлу в параметре Путь к сертификату.
en: Note: when the client certificate is in the store, DER-encoded X.509 export from the store to .CER file and specification of path to such file in the Certificate path parameter are obligatory.

source: Примечание: при указании пути к сертификату допустимо использование как абсолютных путей (с указанием буквы диска), так и относительных.
en: Note: specifying the certificate path, it is allowed to use both absolute (including the drive letter) and relative paths.

source: Примечание: путь к XSD-схеме указывается в параметре Схема, на которую будет ссылаться описание сервиса.
en: Note: the path to the XSD schema is specified in the following parameter: The schema to which the service description will refer.

source: Примечание: рекомендуется помещать дополнительные файлы в папку, в которой установлен Адаптер, а в файле конфигурации Web.config указывать к ним относительные пути.
en: Note: It is recommended to place the additional files into the folder in which the Adapter has been installed, and to specify the relative paths to them in the Web.config configuration file.

source: Программный SP-ключ — программный ключ, рекомендуемый для использования единичных экземпляров Loginom в виртуальных средах без физического доступа к usb портам.
en: Software SP dongle is a software dongle that is recommended for one-off Loginom instances in the virtual environments without physical access to USB ports.

source: Пул приложений — имя пула приложений, обслуживающего Loginom Integrator.
en: Application pool — name of the application pool supporting Loginom Integrator.

source: Путь к сертификату — при использовании шифрования указывается путь к клиентскому сертификату.
en: The Certificate path — when using encryption, it is required to specify the path to the client certificate.

source: Работа с сертификатами
en: The Certificates Usage

source: Редакции для коллективной работы
en: Editions for the teamwork

source: Редакции для персональной работы.
en: Editions for Personal Work.

source: Режим отладки — флаг, указывающий, что при ошибках в работе Адаптера следует выдавать отладочную информацию.
en: Debug mode — the flag that shows that it is required to show the debugging information in the case of errors during the Adapter usage.

source: Рисунок 1.
en: Figure 1.

source: Рисунок 10.
en: Figure 10.

source: Рисунок 3.
en: Figure 3.

source: Рисунок 4.
en: Figure 4.

source: Рисунок 5.
en: Figure 5.

source: Рисунок 6.
en: Figure 6.

source: Рисунок 7.
en: Figure 7.

source: Рисунок 8.
en: Figure 8.

source: Рисунок 9.
en: Figure 9.

source: Сайт — имя существующего сайта IIS, на котором будет развернут Loginom Integrator.
en: Site is a name of the existing IIS site on which Loginom Integrator will be deployed.

source: Сертификат SSL, Ключ SSL — полные пути к файлам сертификата и ключа SSL в формате pem.
en: The SSL certificate, SSL key are the full paths to the certificate file and SSL key in the pem format.

source: Сетевой USB-ключ — физический ключ, который рекомендуется для использования большого количества экземпляров Loginom в локальной сети.
en: Network USB dongle is a physical dongle that is recommended for a number of Loginom instances in the local network.

source: Справочно: хранилище сертификатов локального компьютера доступно для всех пользователей.
en: For reference: the certificate store of the local computer is available for all users.

source: Строка запроса (Request Line):
en: Request line (Request Line):

source: Схема, на которую будет ссылаться описание сервиса — задает путь к XSD-схеме описания сервиса.
en: The schema to which the service description will refer — it specifies the path to the XSD schema of the service description.

source: Таймаут — максимально допустимое время в секундах между запросом и ответом об окончании обработки запроса.
en: Timeout — the maximum allowed time expressed in seconds between a request and response on completion of the request processing.

source: Тело сообщения (Entity Body):
en: Message body (Entity Body):

source: Удаление
en: Uninstalling

source: Установить драйвера Guardant x64 — запускает установку в автоматическом режиме драйверов для работы электронного ключа защиты.
en: Install the Guardant x64 driver enables the installation to start in the automatic driver mode for the software protection dongle operation.

source: Установка
en: Installation

source: Формат сообщения — может принимать одно из трех значений: plainXml, soap, soap12.
en: Message format can take one of three values: plainXml, soap, or soap12.

source: Хост — адрес хоста сервера Loginom.
en: Host — the Loginom server host address.

source: Хост — определяет значение параметра host.
en: Host defines the value of the host parameter.

source: Хранилище сертификата — может принимать одно из трех значений: none, currentUser, localMachine.
en: The certificate store — one of three values can be taken: none, currentUser, or localMachine.

source: ключи_msi — допустимые значения можно узнать, выполнив в командной строке msiexec /?.
en: msi_options — it is possible to find allowable values executing the following command in the command line: msiexec /?.

source: Лицензионные ключи).
en: Licensing Dongles).

source: HTTP порт веб-сервера
en: Web server HTTP port

source: HTTPS порт веб-сервера
en: Web server HTTPS port

source: IIS 8.0 и выше, DotNet 4.5
en: IIS 8.0 and higher, DotNet 4.5

source: Java Runtime Environment (JRE) версии не ниже 6 — обязательное требование для подключения к сервисам Национальный Хантер и Equifax FPS.
en: Java Runtime Environment (JRE) version 6 or higher is a mandatory requirement for connection to the National Hunter and Equifax FPS services.

source: Loginom Desktop не включает инструменты для совместной работы, разграничения прав, публикации и работы с веб-сервисами.
en: Loginom Desktop does not include tools for collaborative work, division of rights, publications and work with web services.

source: Loginom Integrator должен отдать WSDL SOAP веб-сервиса с предупреждением:
en: Loginom Integrator must give WSDL of the SOAP web service with the following warning:

source: Loginom Integrator должен отдать страницу описания работы с REST сервисом.
en: Loginom Integrator must give the page with the REST service operation description.

source: Loginom Integrator может поддерживать соединения с несколькими экземплярами Loginom Server одновременно.
en: Loginom Integrator can support connections with several Loginom Server instances simultaneously.

source: Loginom Integrator настраивается с помощью xml файла Web.config.
en: Loginom Integrator is configured by means of the xml Web.config file.

source: Loginom Integrator поддерживает информацию о работоспособности серверов и опубликованных на них пакетах.
en: Loginom Integrator maintains the information on operability of servers and packages published on them.

source: Loginom Server
en: The Loginom Server

source: Loginom Server предназначен для развертывания во внутренней сети, когда подразумевается работа более чем одного пользователя с различных рабочих мест.
en: The Loginom Server is designated for deployment in the internal network when the work of more than one user from different working places is anticipated.

source: Loginom Server — ключевой элемент платформы, необходимый для коллективной работы.
en: The Loginom Server is a key platform element required for teamwork.

source: Loginom может запускаться только там, где установлен ключ;
en: Loginom will be started only on computer with the installed dongle.

source: Loginom не работает при подключении к системе в режиме RDP-сессии.
en: Loginom cannot be used when connecting to the system in the mode of RDP session.

source: Loginom — руководство администратора
en: Loginom — Administrator Manual

source: LoginomAcademic_6.x.x.msi — инсталлятор для редакции Academic
en: LoginomAcademic_6.x.x.msi — installer for the Academic edition

source: LoginomEnterprise_6.x.x.msi – инсталлятор для редакции Enterprise
en: LoginomEnterprise_6.x.x.msi – the installer for Enterprise edition

source: LoginomPersonal_6.x.x_x64.msi — инсталлятор для редакции Personal 64-битной версии
en: LoginomPersonal_6.x.x_x64.msi — installer for the 64-bit Personal edition

source: LoginomPersonal_6.x.x_x86.msi — инсталлятор для редакции Personal 32-битной версии
en: LoginomPersonal_6.x.x_x86.msi — installer for the 32-bit Personal edition

source: LoginomStandard_6.x.x.msi – инсталлятор для редакции Standard
en: LoginomStandard_6.x.x.msi – the installer for Standard edition

source: LoginomTeam_6.x.x.msi – инсталлятор для редакции Team
en: LoginomTeam_6.x.x.msi – the installer for Team edition

source: NET, установить режим управляемого конвейера — встроенный.
en: NET, to set the controlled conveyer mode — embedded.

source: Namespace корневого элемента SOAP ответа; Namespace корневого элемента SOAP ответа
en: Namespace of the root element of the SOAP response; Namespace of the root element of the SOAP response

source: SQL запрос
en: SQL Query

source: SQL запрос задается в атрибуте sqlCommand.
en: SQL query is specified in the sqlCommand attribute.

source: URI веб-интерфейса Loginom Studio
en: URI of the Loginom Studio web interface

source: WSDL сервиса формируется, исходя из следующих параметров:
en: The WSDL service is formed on the basis of the following parameters:

source: WSDL-описание однозначно определяет параметры взаимодействия с веб-сервисом, в том числе и форматы XML-сообщений, посредством которых это взаимодействие осуществляется.
en: The WSDL description enables a clear definition of parameters of interaction to be provided with the web service, by means of which such interaction is performed including the XML message formats.

source: Web-сервер IIS
en: IIS Web Server

source: Windows 7 и выше
en: Windows 7 and higher

source: Windows Server 2008 и выше
en: Windows Server 2008 and higher

source: Windows Server 2012 и выше
en: Windows Server 2012 and higher

source: XSD-схема может содержать ссылки на связанные XSD-схемы.
en: The XSD schema can contain references to the associated XSD schemas.

source: msiexec /i "путь_к_msi_файлу" ключи_msi параметры_loginom
en: msiexec /i "path_to_package" msi_options loginom_options

source: msiexec /x Loginom<Редакця>_6.x.x.msi /qn
en: msiexec /x Loginom<Edition>_6.x.x.msi /qn

source: Авторизоваться с учетной записью user с пустым паролем.
en: Log in as user with blank password.

source: Адрес привязки сайта IIS
en: IIS site binding address

source: Активация программного SP-ключа
en: Activation of Software SP Dongle

source: Активация программного SP-ключа для систем без доступа к интернету
en: Activation of Software SP Dongle for Offline Systems

source: Активация программного SP-ключа для систем без интернета
en: Software SP Dongle Activation for Offline Systems

source: Алгоритм действий на этапе отправки запроса внешнему сервису представлен на рисунке 8.
en: Algorithm of actions at the stage of the request sending to the external service is shown in Figure 8.

source: Алгоритм действий на этапе отправки запроса внешнему сервису
en: The algorithm of Actions at the Stage of the Request Sending to the External Service

source: Алгоритм действий на этапе получения ответа от внешнего сервиса представлен на рисунке 10.
en: The algorithm of actions at the stage of the response receipt from the external service is shown in

source: Алгоритм действий на этапе получения ответа от внешнего сервиса
en: The algorithm of Actions at the Stage of the Response Receipt from the External Service

source: Аналитическая платформа Loginom может функционировать в серверном режиме для коллективной работы и в виде настольного приложения для персональной аналитики.
en: The analytical Loginom platform can be operated in the server mode for the teamwork and as a desktop application for the personal analytics.

source: Аналитический сервер, выполняет задачи загрузки, расчетов, построения моделей, визуализации, управления правами и прочее.
en: It is an analytical server responsible for loading tasks, calculations, model training, visualisation, rights management, etc.

source: Аналогично, для описания структуры исходящего сообщения (ответа) этого метода используется элемент схемы ChequesResponse.
en: Similarly, to describe the incoming message (response) structure of this method, the ChequesResponse schema element is used.

source: Аппаратное обеспечение
en: Hardware

source: Атрибуты с именами полей могут отсутствовать или содержать пустые значения.
en: Attributes with field names can be absent or contain blank values.

source: Блок IIS:
en: IIS block:

source: Блок Подключение к Loginom Server:
en: Connection to the Loginom Server block:

source: В аналитической платформе Loginom имеются компоненты интеграции с SOAP и REST сервисами, которые реализуют наиболее распространенные варианты взаимодействия с веб-сервисами.
en: There are components of integration with the SOAP and REST services in the analytical Loginom platform that implement the most wide-spread variants of interaction with the web services.

source: В данном примере по ссылке /WebServiceProxy/Service.svc?xsd=xsd1 конструкцией <xsd:import … > импортируется XSD-схема описания сервиса.
en: According to this example by the following reference: /WebServiceProxy/Service.svc?xsd=xsd1 <xsd:import … >, construction enables the importing of the XSD schema of the service description.

source: В диспетчере служб IIS необходимо создать новый пул приложений, в котором будет работать Loginom Adapter.
en: It is required to create a new application pool in the IIS service manager that will work with the Loginom Adapter

source: В каталог Loginom 6\Client надо поместить файл web.config следующего содержания:
en: It is required to place the web.config file with the following content into the Loginom 6\Client directory:

source: В качестве устанавливаемых значений в запросе требуется указывать следующие параметры:
en: It is required to specify the following parameters in the query as set values:

source: В командной строке, запущенной от имени администратора:
en: In the command line running as an administrator:

source: В открывшемся окне для параметра Удостоверение (Identity) задаем предварительно созданную особую учетную запись пула приложений, обладающую необходимыми правами для работы Адаптера.
en: In the opened window for the Identity (Identity) parameter, it is required to set the pre-created special login account of the application pool with the required rights essential for the Adapter operation.

source: В последнем случае путь задается относительно папки, в которой расположен файл Web.config.
en: In the latter case, the path is specified to the folder in which the Web.config file is located.

source: В появившемся окне Добавление пула приложений необходимо задать значения параметров: имя пула для Адаптера, например, LoginomAdapterAppPool, указать версию среды CLR.
en: In the Application Pool Addition window that appears, it is required to set the values of the following parameters: the pool name for the Adapter, for example, LoginomAdapterAppPool, to specify CLR environment version.

source: В противном случае Адаптер не сможет обратиться к клиентскому сертификату, расположенному в хранилище (см.
en: Otherwise, the Adapter will not be able to refer to the client certificate located in the store (also refer to

source: В самом скрипте могут быть определены входные параметры, как это показано в следующем примере:
en: The input parameters can be specified in the script as such, as it is represented by means of the following example:

source: В свою очередь Адаптер:
en: In return the Adapter performs the following tasks::

source: В связи с этим значение параметра подчиняется правилам именования элементов XML в соответствии со спецификацией W3C.
en: In this regard, the parameter value is subject to the rules of naming of the XML elements under W3C specification.

source: В случае с REST-сервисом содержимым ответа является тело сообщения (Entity Body) HTTP/HTTPS полученного пакета.
en: In the case of the REST service, the response content is the message body (Entity Body) HTTP/HTTPS of the received package.
